app/Models/ModelBarang.php

SELECT *
FROM `barang`
---
    public function getBarang()
    {
        $builder=$this->db->table('barang');
        return $builder->get();

UPDATE `barang` SET `namabarang` = 'Nutrisari', `satuan` = 'Pcs', `stok` = '10', `hargabeli` = '2000', `hargajual` = '3000'
WHERE `idbarang` = 'B0001'
---
    public function updateBarang($data,$id)
    {
        $query = $this->db->table('barang')->update($data,array('idbarang' => $id));