app/Models/ModelPenjualan.php

SELECT *
FROM `barang`
---
    public function getBarang()
    {
        $builder=$this->db->table('barang');
        return $builder->get();

INSERT INTO `jual` (`idbarangjual`, `tanggal`, `jumlahjual`) VALUES ('B0001', '2024-01-04', '9')
---
    public function insertData($data)
    {
        $this->db->table('jual')->insert($data);